Repository: murvudd/gentle-stream
Catalog: locale/*/LC_MESSAGES/django.po
Languages: pl

source: Home
pl: Strona Główna

source: Data Policy
pl: Polityka Danych

source: Contact Me
pl: Kontakt

source: Make your own app at Heroku
pl: Stwórz własną aplikację na Heroku

source: Data policy
pl: Polityka Danych

source: is anonymous and DOES NOT log:
pl: jest anonimowe i NIE zapisuje:

source: Your email
pl: Twojego emaila

source: Your Spotify login
pl: Twojego loginu

source: Any data that could identify you
pl: Żadnych danych które umożliwiły by identyfikację

source: does log
pl: zapisuje pobrane poprzez

source: access and refresh tokens with these
pl: tokeny tymi zakresami określanymi dalej jako

source: scopes
pl: zakresami

source: Which will be used to create custom database of Spotify users listenging preferences
pl: Wszystkie te dane zostaną użyte do stworzenia bazy danych preferencji użytkownika, która zostanie wykorzystana tylko do mojej pracy magisterskiej

source: If you want to revoke your permission, just head on to your Spotify account, apps tab, and click remove access
pl: Jeżeli w jakim kolwiek momencie zechesz odwołać dostęp do Twoich danych Spotify, przejdź do ustawień swojego konta, aplikacje i odwołaj dostęp

source: By clicking Let's go button below, you confirm that you have read, and accept this Data Policy
pl: Klikając Zaczynajmy poniżej, potwierdzasz zapoznanie się z tą polityką danych, oraz jej akceptację.

source: This application is a part of a masters deegre. In order to get real users preferences, Gente Stream logs your Spotify account listening preferences
pl: Ta aplikacja jest częścią pracy magisterskiej.

source: Source on GitHub
pl: Źródło

source: Please read how does the app work, and data policy below
pl: Proszę zapoznaj się z Polityką Danych

source: How this app works
pl: Jak to działa

source: The app saves your access token to Spotify API.
pl: Aplikacja zapisuje tokeny dostępu do Spotify API.

source: The token is used only to read your listening preferences. (based on token scopes, the app can not modify anything.)
pl: Token pozwala pobrać preferencje muzyczne użytkownika Spotify (wybrany zakres uniemożliwia modyfikowanie czego kolwiek na twoim koncie Spotify)

source: Data will be use to train neural network to provide new music based on given preferences. Neural network is part of my master's degree thesis
pl: Twoje peferencje zostaną użyte do uczenia sieci neuronowej na potrzeby mojej pracy magisterskiej. Celem sieci jest proponowanie użytkownikom nowej muzyki.

source: Because Gentle Stream is anonymous (and does not want to use cookies), there is no mechanism to check if you already have used the app. Because of this, please use the Let's Go button only once
pl: Ponieważ Gentle Stream jest anonimowe (i nie korzysta z plików cookie), nie ma żadnego mechanizmu sprawdzającego czy już użyto tej aplikacji. Proszę o kliknięcie Zaczynajmy! tylko raz.

source: Let's go!
pl: Zaczynajmy!

source: Thank You
pl: Dziękuję Bardzo

source: that's all
pl: to wszystko

source: Go back
pl: powrót
